MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX575F512H.PIC
      <edc:SFRDef edc:_addr="0x1F881040" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="nnn--nnnnnnnnnnnnn---nnnnnnnnnnn" edc:cname="IFS1" edc:desc="" edc:grp="INT" edc:impl="0xe7ffc7ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxx--x00xxxx000000---00000000000" edc:name="IFS1" edc:nzwidth="0x20" edc:por="xxx--x00xxxx000000---00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIF" edc:desc="" edc:mask="0x1" edc:name="CNIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="AD1IF" edc:desc="" edc:mask="0x1" edc:name="AD1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PMPIF" edc:desc="" edc:mask="0x1" edc:name="PMPIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1IF" edc:desc="" edc:mask="0x1" edc:name="CMP1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2IF" edc:desc="" edc:mask="0x1" edc:name="CMP2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3EIF" edc:desc="" edc:mask="0x1" edc:name="U3EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3RXIF" edc:desc="" edc:mask="0x1" edc:name="U3RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3TXIF" edc:desc="" edc:mask="0x1" edc:name="U3TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2EIF" edc:desc="" edc:mask="0x1" edc:name="U2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2RXIF" edc:desc="" edc:mask="0x1" edc:name="U2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2TXIF" edc:desc="" edc:mask="0x1" edc:name="U2TXIF" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="FSCMIF" edc:desc="" edc:mask="0x1" edc:name="FSCMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTCCIF" edc:desc="" edc:mask="0x1" edc:name="RTCCIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA0IF" edc:desc="" edc:mask="0x1" edc:name="DMA0IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA1IF" edc:desc="" edc:mask="0x1" edc:name="DMA1IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA2IF" edc:desc="" edc:mask="0x1" edc:name="DMA2IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA3IF" edc:desc="" edc:mask="0x1" edc:name="DMA3IF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DMA4IF" edc:desc="" edc:mask="0x1" edc:name="DMA4IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA5IF" edc:desc="" edc:mask="0x1" edc:name="DMA5IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA6IF" edc:desc="" edc:mask="0x1" edc:name="DMA6IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="DMA7IF" edc:desc="" edc:mask="0x1" edc:name="DMA7IF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="FCEIF" edc:desc="" edc:mask="0x1" edc:name="FCEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="USBIF" edc:desc="" edc:mask="0x1" edc:name="USBIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CAN1IF" edc:desc="" edc:mask="0x1" edc:name="CAN1IF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="IC1EIF" edc:desc="" edc:mask="0x1" edc:name="IC1EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC2EIF" edc:desc="" edc:mask="0x1" edc:name="IC2EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC3EIF" edc:desc="" edc:mask="0x1" edc:name="IC3EIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="U2AEIF" edc:desc="" edc:mask="0x1" edc:name="U2AEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2ARXIF" edc:desc="" edc:mask="0x1" edc:name="U2ARXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U2ATXIF" edc:desc="" edc:mask="0x1" edc:name="U2ATXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3AEIF" edc:desc="" edc:mask="0x1" edc:name="U3AEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3ARXIF" edc:desc="" edc:mask="0x1" edc:name="U3ARXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="U3ATXIF" edc:desc="" edc:mask="0x1" edc:name="U3ATXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPI2EIF" edc:desc="" edc:mask="0x1" edc:name="SPI2EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2TXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4EIF" edc:desc="" edc:mask="0x1" edc:name="SPI4EIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4RXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4RXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI4TXIF" edc:desc="" edc:mask="0x1" edc:name="SPI4TXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.2">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="SPI2AEIF" edc:desc="" edc:mask="0x1" edc:name="SPI2AEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2ARXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2ARXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI2ATXIF" edc:desc="" edc:mask="0x1" edc:name="SPI2ATXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3AEIF" edc:desc="" edc:mask="0x1" edc:name="SPI3AEIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3ARXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3ARXIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SPI3ATXIF" edc:desc="" edc:mask="0x1" edc:name="SPI3ATXIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.3">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="I2C4BIF" edc:desc="" edc:mask="0x1" edc:name="I2C4BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4SIF" edc:desc="" edc:mask="0x1" edc:name="I2C4SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C4MIF" edc:desc="" edc:mask="0x1" edc:name="I2C4MIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C5BIF" edc:desc="" edc:mask="0x1" edc:name="I2C5BIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C5SIF" edc:desc="" edc:mask="0x1" edc:name="I2C5SIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C5MIF" edc:desc="" edc:mask="0x1" edc:name="I2C5MIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.4">
            <edc:AdjustPoint edc:offset="0x5"/>
            <edc:SFRFieldDef edc:cname="I2C2ABIF" edc:desc="" edc:mask="0x1" edc:name="I2C2ABIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2ASIF" edc:desc="" edc:mask="0x1" edc:name="I2C2ASIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C2AMIF" edc:desc="" edc:mask="0x1" edc:name="I2C2AMIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3ABIF" edc:desc="" edc:mask="0x1" edc:name="I2C3ABIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3ASIF" edc:desc="" edc:mask="0x1" edc:name="I2C3ASIF" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="I2C3AMIF" edc:desc="" edc:mask="0x1" edc:name="I2C3AMIF" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.5">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F881050" edc:_begin="0x0" edc:_end="0x160" edc:_modsrc="DOS-01166_TDAA_int_evic.Module" edc:_refcount="1" edc:access="--------------------nnnnnnnnnnnn" edc:cname="IFS2" edc:desc="" edc:grp="INT" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------------------x00000000000" edc:name="IFS2" edc:nzwidth="32" edc:por="--------------------x00000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="IC4EIF" edc:desc="" edc:mask="0x1" edc:name="IC4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="IC5EIF" edc:desc="" edc:mask="0x1" edc:name="IC5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="PMPEIF" edc:desc="" edc:mask="0x1" edc:name="PMPEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1BEIF" edc:desc="" edc:mask="0x1" edc:name="U1BEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1BRXIF" edc:desc="" edc:mask="0x1" edc:name="U1BRXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U1BTXIF" edc:desc="" edc:mask="0x1" edc:name="U1BTXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2BEIF" edc:desc="" edc:mask="0x1" edc:name="U2BEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2BRXIF" edc:desc="" edc:mask="0x1" edc:name="U2BRXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U2BTXIF" edc:desc="" edc:mask="0x1" edc:name="U2BTXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3BEIF" edc:desc="" edc:mask="0x1" edc:name="U3BEIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3BRXIF" edc:desc="" edc:mask="0x1" edc:name="U3BRXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U3BTXIF" edc:desc="" edc:mask="0x1" edc:name="U3BTXIF" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="U4EIF" edc:desc="" edc:mask="0x1" edc:name="U4EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4RXIF" edc:desc="" edc:mask="0x1" edc:name="U4RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U4TXIF" edc:desc="" edc:mask="0x1" edc:name="U4TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6EIF" edc:desc="" edc:mask="0x1" edc:name="U6EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6RXIF" edc:desc="" edc:mask="0x1" edc:name="U6RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U6TXIF" edc:desc="" edc:mask="0x1" edc:name="U6TXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5EIF" edc:desc="" edc:mask="0x1" edc:name="U5EIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5RXIF" edc:desc="" edc:mask="0x1" edc:name="U5RXIF" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="U5TXIF" edc:desc="" edc:mask="0x1" edc:name="U5TXIF" edc:nzwidth="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.1">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
