MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX575F512H.PIC
      <edc:SFRDef edc:_addr="0x1F883620" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="8" edc:access="----------------rrrrrrrrrrrrrrrr" edc:cname="DCH7DPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0000000000000000" edc:name="DCH7DPTR" edc:nzwidth="0x20" edc:por="----------------0000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHDPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHDPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883630" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7CSIZ" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH7CSIZ" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCSIZ" edc:desc="" edc:islanghidden="true" edc:mask="0xffff" edc:name="CHCSIZ" edc:nzwidth="16"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883640" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="8" edc:access="----------------nnnnnnnnnnnnnnnn" edc:cname="DCH7CPTR" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------xxxxxxxxxxxxxxxx" edc:name="DCH7CPTR" edc:nzwidth="0x20" edc:por="----------------xxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHCPTR" edc:desc="" edc:islanghidden="true" edc:mask="0xFFFF" edc:name="CHCPTR" edc:nzwidth="0x10"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F883650" edc:_begin="0x60" edc:_end="0x120" edc:_modsrc="DOS-00735_dma_bvci_v1.Module" edc:_refcount="8" edc:access="------------------------nnnnnnnn" edc:cname="DCH7DAT" edc:desc="" edc:grp="DMAC0" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------xxxxxxxx" edc:name="DCH7DAT" edc:nzwidth="0x20" edc:por="------------------------xxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="DMAC7">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DCHPDAT" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="DCHPDAT" edc:nzwidth="0x8"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F883660" edc:offset="2464"/>
      <edc:SFRDef edc:_addr="0x1F884000" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="---------------n------nn--nn-nnn" edc:cname="CHECON" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------0------00--00-111" edc:name="CHECON" edc:nzwidth="0x20" edc:por="---------------0------00--00-111" edc:portals="CLR SET INV" ltx:baseofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="PFMWS" edc:desc="" edc:mask="0x7" edc:name="PFMWS" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="PREFEN" edc:desc="" edc:mask="0x3" edc:name="PREFEN" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="2"/>
            <edc:SFRFieldDef edc:cname="DCSZ" edc:desc="" edc:mask="0x3" edc:name="DCSZ" edc:nzwidth="0x2"/>
            <edc:AdjustPoint edc:offset="6"/>
            <edc:SFRFieldDef edc:cname="CHECOH" edc:desc="" edc:mask="0x1" edc:name="CHECOH" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884010" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEACC" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CHEACC" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEIDX" edc:desc="" edc:mask="0xf" edc:name="CHEIDX" edc:nzwidth="0x4"/>
            <edc:AdjustPoint edc:offset="27"/>
            <edc:SFRFieldDef edc:cname="CHEWEN" edc:desc="" edc:mask="0x1" edc:name="CHEWEN" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884020" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="n-------nnnnnnnnnnnnnnnnnnnnnnn-" edc:cname="CHETAG" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0xxxxxxxxxxxxxxxxxxxxxxxxxxx0010" edc:name="CHETAG" edc:nzwidth="0x20" edc:por="0xxxxxxxxxxxxxxxxxxxxxxxxxxx0010" edc:portals="CLR SET INV" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="LTYPE" edc:desc="" edc:mask="0x1" edc:name="LTYPE" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LLOCK" edc:desc="" edc:mask="0x1" edc:name="LLOCK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LVALID" edc:desc="" edc:mask="0x1" edc:name="LVALID" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LTAG" edc:desc="" edc:mask="0x1" edc:name="LTAG" edc:nzwidth="0x14"/>
            <edc:AdjustPoint edc:offset="7"/>
            <edc:SFRFieldDef edc:cname="LTAGBOOT" edc:desc="" edc:mask="0x1" edc:name="LTAGBOOT" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884030" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEMSK" edc:desc="" edc:grp="PCACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="CHEMSK" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="5"/>
            <edc:SFRFieldDef edc:cname="LMASK" edc:desc="" edc:mask="0x7ff" edc:name="LMASK" edc:nzwidth="0xb"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884040" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEW0" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CHEW0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEW0" edc:desc="" edc:mask="0xffffffff" edc:name="CHEW0" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884050" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEW1" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CHEW1" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEW1" edc:desc="" edc:mask="0xffffffff" edc:name="CHEW1" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F884060" edc:_begin="0x0" edc:_end="0xb0" edc:_modsrc="DOS-00815_pfm_cache_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="CHEW2" edc:desc="" edc:grp="CACHE" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:name="CHEW2" edc:nzwidth="0x20" edc:por="xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx" edc:portals="- - -" ltx:memberofperipheral="PCACHE">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CHEW2" edc:desc="" edc:mask="0xffffffff" edc:name="CHEW2" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
